app/views/users/_user.html.erb

SELECT COUNT(*) FROM `microposts` WHERE `microposts`.`user_id` = 6
---
				<div class="number-post">
					<strong><%= user.microposts.count %></strong>