app/controllers/comments_controller.rb

	def create
		@micropost = Micropost.find_by(id: params[:micropost_id])
		@comment = Comment.create(micropost_id: @micropost.id,
					user_id: current_user.id, content: params[:content])
---
SELECT  `microposts`.* FROM `microposts` WHERE `microposts`.`id` = 2 ORDER BY `microposts`.`created_at` DESC LIMIT 1
INSERT INTO `comments` (`content`, `created_at`, `updated_at`, `user_id`, `micropost_id`) VALUES ('msaodsodsadsa', '2017-05-06 15:04:11', '2017-05-06 15:04:11', 1, 2)

	def destroy
		@comment = Comment.find_by(id: params[:id])
		@notification = Notification.find_by(comment_id: @comment.id)

		if @notification != nil
			@notification.destroy
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 1 LIMIT 1
SELECT  `notifications`.* FROM `notifications` WHERE `notifications`.`comment_id` = 1 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 1
DELETE FROM `notifications` WHERE `notifications`.`id` = 2