app/controllers/likes_controller.rb

SELECT  `microposts`.* FROM `microposts` WHERE `microposts`.`id` = 3 ORDER BY `microposts`.`created_at` DESC LIMIT 1
INSERT INTO `likes` (`created_at`, `updated_at`, `user_id`, `micropost_id`) VALUES ('2017-05-06 15:04:01', '2017-05-06 15:04:01', 1, 3)
---
	def create
		@micropost = Micropost.where(id: params[:micropost_id]).first
		@like = Like.create(micropost_id: @micropost.id, user_id: current_user.id)

SELECT  `likes`.* FROM `likes` WHERE `likes`.`id` = 1 LIMIT 1
SELECT  `microposts`.* FROM `microposts` WHERE `microposts`.`id` = 3 ORDER BY `microposts`.`created_at` DESC LIMIT 1
SELECT  `notifications`.* FROM `notifications` WHERE `notifications`.`like_id` = 1 LIMIT 1
DELETE FROM `likes` WHERE `likes`.`id` = 1
---
	def destroy
		@like = Like.find_by(id: params[:id])
		@micropost = Micropost.find_by(id: @like.micropost_id)
		@notification = Notification.find_by(like_id: @like.id)

		if @notification != nil
			@notification.destroy