app/controllers/microposts_controller.rb

INSERT INTO `microposts` (`content`, `user_id`, `created_at`, `updated_at`, `picture`) VALUES ('mppmp', 1, '2017-05-06 14:49:54', '2017-05-06 14:49:54', 'Dumbledore_Grindelwald.png')
---
	def create
		@micropost = current_user.microposts.build(micropost_params)
		if @micropost.save

SELECT  `microposts`.* FROM `microposts` WHERE `microposts`.`id` = 3 ORDER BY `microposts`.`created_at` DESC LIMIT 1
---
	def show
		@micropost = Micropost.find_by(id: params[:id])

SELECT `notifications`.* FROM `notifications` WHERE `notifications`.`micropost_id` = 1
DELETE FROM `notifications` WHERE `notifications`.`id` = 1
DELETE FROM `microposts` WHERE `microposts`.`id` = 1
---
	def destroy
		@notifications = Notification.where(micropost_id: @micropost.id)
		post_id = @micropost.id
		if @notifications != nil
			@notifications.each do |notification|
				notification.destroy
			end
		end
		@micropost.destroy