app/controllers/notifications_controller.rb

    def link_through
        @notification = Notification.find_by(id: params[:id])
        @notification.update read: true
---
SELECT  `notifications`.* FROM `notifications` WHERE `notifications`.`id` = 2 LIMIT 1
UPDATE `notifications` SET `read` = 1, `updated_at` = '2017-05-06 15:35:35' WHERE `notifications`.`id` = 2

    def index
        @notifications = current_user.notifications
        .paginate(page: params[:page], per_page: 6).order("id DESC")
---
SELECT  `notifications`.* FROM `notifications` WHERE `notifications`.`user_id` = 1 ORDER BY id DESC LIMIT 6 OFFSET 0