app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE (name like '%Luna%') ORDER BY name ASC LIMIT 6 OFFSET 0
SELECT COUNT(*) FROM `users`
---
	def index
		if(params[:search])
			@users = User.search(params[:search]).order('name ASC')
				.paginate(page: params[:page], per_page: 6)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `microposts`.* FROM `microposts` WHERE `microposts`.`user_id` = 1 ORDER BY `microposts`.`created_at` DESC
---
	def show
		@user = User.find_by(id: params[:id])
		if @user == nil
			not_found
		else
			@user1 = @user

			if params[:last_id]
				@microposts = @user.microposts.where("id < ? and user_id = ?",
					params[:last_id], @user.id)

INSERT INTO `users` (`name`, `email`, `gender`, `created_at`, `updated_at`, `password_digest`) VALUES ('Harry Potter', 'harry@gmail.com', 'Male', '2017-05-06 14:42:38', '2017-05-06 14:42:38', '$2a$10$IROdL6op2sOs4IvOviYDZ.6Ms7xG/ajGDQoxPNDEJkfiek.65BCJ6')
---
	def create
		@user = User.new(user_params)
		if @user.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `password_digest` = '$2a$10$OXErgc3GsRni8CvV4PpipesRus1WqrrUPOX1mpX9gXXduOO2zn0w6', `updated_at` = '2017-05-06 14:43:14' WHERE `users`.`id` = 1
---
	def update
		@user = User.find(params[:id])
		if @user.update_attributes(user_params)