app/views/layouts/_header.html.erb

SELECT `notifications`.* FROM `notifications` WHERE `notifications`.`user_id` = 1
---
						<% count = 0 %>
						<% current_user.notifications.each do |notification| %>

SELECT  `notifications`.* FROM `notifications` WHERE `notifications`.`user_id` = 1 ORDER BY id DESC LIMIT 3
---
						<li>Notifications</li>
						<%= render current_user.notifications.order('id DESC').first(3) %>